{
  "layers": [
    {
      "url": "assets/bg.jpg",
      "x": 0,
      "y": 0,
      "z": 0
    },
    {
      "url": "assets/3D.png",
      "x": 0,
      "y": 0,
      "z": 0
    },
    {
      "url": "assets/fauna.png",
      "x": 0,
      "y": 0,
      "z": 0
    },
    {
      "url": "assets/flora.png",
      "x": 0,
      "y": 0,
      "z": 0
    },
    {
      "url": "assets/flora2.png",
      "x": 0,
      "y": 0,
      "z": 0
    },
    {
      "url": "assets/labels.png",
      "x": 0,
      "y": 0,
      "z": 0
    },
    {
      "url": "assets/nuvens.png",
      "x": 0,
      "y": 0,
      "z": 0.4,
      "scale": 0.5
    }
  ],
  "poi": [
    {
      "x": 0.08,
      "y": -0.19,
      "title": "City of Funchal",
      "text": "We invite you to walk downtown streets, which carry 600 years of history. Next to the market, catch a glimpse of Rua Fernão de Ornelas, the busiest street in Funchal. Pass by the Cathedral and the Bazar do Povo centenary building. Look for our terraces in Avenida do Mar and finish at Largo do Socorro."
    },
    {
      "x": -0.0080,
      "y": -0.06,
      "title": "Curral das Freiras",
      "text": "Before the tunnel, access the viewpoints of Paredão or Eira do Serrado, and surprise yourself with this typical Madeira's village right inside a cauldron! Don't miss the Chestnut Museum, the parish's king of fruits, which is used in soups, cake or chestnut cookies. Delight yourself with the sour cherries, transformed into liquor."
    },
    {
      "x" : -0.07,
      "y" : -0.172,
      "title" : "Cabo Girão Viewpoint",
      "text" : "This glass platform located at an altitude of 580m grants an astonishing view over the southern coast. It is located in Europe's highest cape, very popular amongst paragliding and base-jumping lovers. One can usually find catamarans anchored off the Fajās, watching dolphins or diving in this Nature Reserve."
    },
    {
      "x" : -0.222,
      "y" : -0.126,
      "title" : "Ponta do Sol Village",
      "text" : "Bathed by a genuine and inviting pebble beach, the picturesque village of Ponta do Sol, with many hours of sunshine throughout the year, hence its name, breathes tranquillity and relaxation. Its hallmark continues to be the beautiful Levada Velha do Moinho waterfall, although its folklore or theatre cultural festivals also have international projection."
    },
    {
      "x": -0.409,
      "y": 0.015,
      "title": "Paul do Mar",
      "text": "After zigzagging along the traditional Portuguese stone pathways in Jardim do Mar, let yourself be swept away by the tranquillity of Paul do Mar, also sheltered between the mountain and the sea. The waves attract surfers from all over the world for international championships. There are 2600 steps to Prazeres, through a path of stunning views."
    },
    {
      "x": -0.46,
      "y": 0.1225,
      "title": "Ponta do Pargo Lighthouse",
      "text": "At Madeira's westernmost point, the Ponta do Pargo Lighthouse, which stands on a cliff close to the sea, offers since 2001 a museum centre dedicated to the various lighthouses of the archipelago. It is a privileged spot to watch the sunset. The Garganta Funda viewpoint is also worth the stop, as the Fio viewpoint, where you can enjoy a lovely cup of tea."
    },
    {
      "x": -0.025,
      "y": -0.19,
      "title": "City of Câmara de Lobos",
      "text": "Fishing tradition is strong in the land of the sea-wolf. There are catfish drying on the bay and urban art covering the downtown area. It is the region's largest grape producer, however, in the evening, residents drink mainly poncha and Nikita (a mixture of ice cream, pineapple with beer or white wine)."
    },
    {
      "x": -0.105,
      "y": -0.047,
      "title": "Serra de Água",
      "text": "Located halfway between Ribeira Brava and São Vicente, the famous poncha requires a stop. From here we can see Encumeada, often covered by a cloud that looks like snow coming down the slope. There are other treasures to be found on these mountainous cliffs, when walking along the levadas and the royal path."
    },
    {
      "x": -0.123,
      "y": 0.085,
      "title": "São Vicente Caves and Volcanism Centre",
      "text": "The geology class begins with an underground walk through several 890 thousand-year-old volcanic pipes. In this mystical journey, there are lakes with spring water, stalactite formations and even some ferns that were born in these caves. In the end, an audio-visual show offers visitors a better understanding of the origin of the Madeira archipelago."
    },
    {
      "x": -0.214,
      "y": 0.134,
      "title": "Seixal Port Beach and 'Poças das Lesmas' Natural Pools",
      "text": "This black sandy beach, protected by the port of Seixal, offers easy access to the sea. Perfect for family swims and water sports. Sharing the spot with 'Poças das Lemas', located to the west, this quiet landscape on the north coast offers clear water that allows to observe fish or seaweed."
    },
    {
      "x": -0.274,
      "y": 0.11,
      "title": "Fanal",
      "text": "In the heart of the Laurissilva there are magical places worthy of a fairy tale, ideal for a picnic. Just like Chão da Ribeira, Fanal invites you to slow down, walk its trails and observe its centenary trees. In the middle of the fog, a famous lagoon emerges, which only appears when it rains heavily."
    },
    {
      "x": -0.315,
      "y": 0.219,
      "title": "Porto Moniz Village and Natural Pools",
      "text": "Climb to the Santa viewpoint for a panoramic view of the village, which offers much more than its largest tourist poster, the natural pools. Besides the walking trails, such as the Levada da Ribeira da Janela, it is also possible to explore the stream beds. There are more than 30 canyoning circuits."
    },
    {
      "x": 0.398,
      "y": -0.022,
      "title": "Ponta de São Lourenço",
      "text": "There are exclusive fauna and flora species in the eastern peninsula. Start the trail at sunrise and don't forget to climb to Ponta do Furado and dive at Cais do Sardinha before lunch. A boat tour to the Lighthouse is also a worthy experience."
    },
    {
      "x": 0.3,
      "y": -0.070,
      "title": "Machico",
      "text": "In addition to the numerous viewpoints with magnificent views, the city of Machico offers several walking trails and other fantastic trails only accessible by jeep or MTB, as well as horse riding adventures and diving experiences with dolphins. Take a stroll through the historic centre, which offers a strong presence of Manueline, Mannerism and Baroque architecture."
    },
    {
      "x": 0.175,
      "y": -0.127,
      "title": "Camacha",
      "text": "At Achada, a monument marks the spot where football was played for the first time in Portugal. In this parish with a strong folkloric tradition and dedication to Madeira embroidery and wickerwork, we invite you to visit the emblematic Clock Tower and ride part of the Levada da Serra do Faial by bicycle."
    },
    {
      "x": 0.1152,
      "y": -0.034,
      "title": "Ribeiro Frio",
      "text": "Arriving at the valley of Ribeiro Frio we find the aquaculture station dedicated to trout farming. Two walking tours start here: Vereda dos Balcões and Levada do Furado. The Balcões is short and accessible for everyone, even for those with reduced mobility, and we also recommend a visit to the Balcões Viewpoint, where the native birds come to eat in your hand."
    },
    {
      "x": 0.2017,
      "y": 0.0325,
      "title": "Porto da Cruz Village",
      "text": "This quiet village is located by the sea, in the foothills of Penha d'Águia. Walking up the mountain is a challenge, although the experience is exceptional. There is surfing lessons in Alagoa beach, another activity not to be missed. The local mill, which can be visited all year round, produces sugar cane rum from March to May."
    },
    {
      "x": 0.1173,
      "y": 0.097,
      "title": "Santana",
      "text": "The reference to the traditional Santana houses is inevitable, which can still be visited in the city square, next to the Levada garden, or in the theme park, a few metres from the centre, remembering how the villains' clothing, still used by folkloric groups, were made by hand."
    },
    {
      "x": 0.086,
      "y": 0.056,
      "title": "Queimadas",
      "text": "Due to the unique biodiversity of its ecosystem, the Queimadas Forest Park is a mandatory stop, also a starting point for the waterfalls of Caldeirão Verde and Inferno, in a unique levada, it is also possible to discover the Pico das Pedras trail and other fascinating treasures for geocaching lovers."
    },
    {
      "x": 0.049,
      "y": -0.03,
      "title": "Pico do Areeiro",
      "text": "Watching the sunset at 1818m of altitude is magical, even if there is a mantle of clouds hiding the depth of the mountains. To Pico Ruivo, the highest peak of the island, is a 4-hour walk, but for this show, we suggest the Ninho da Manta viewpoint, right at the beginning of the trail."
    }
  ],
  "routes" : [
    {
      "name" : "Zona Oeste",
      "poi" : [
        {
          "name" : "City of Funchal"
        },
        {
          "name" : "Curral das Freiras"
        },
        {
          "name" : "City of Câmara de Lobos"
        },
        {
          "name" : "Cabo Girão Viewpoint"
        },
        {
          "name" : "Ponta do Sol Village"
        },
        {
          "name" : "Paul do Mar"
        },
        {
          "name" : "Ponta do Pargo Lighthouse"
        }
      ] 
    },
    {
      "name" : "Zona Este e Nordeste",
      "poi" : [
        {
          "name" : "Ponta de São Lourenço"
        },
        {
          "name" : "Machico"
        },
        {
          "name" : "Camacha"
        },
        {
          "name" : "Ribeiro Frio"
        },
        {
          "name" : "Porto da Cruz Village"
        },
        {
          "name" : "Santana"
        },
        {
          "name" : "Queimadas"
        },
        {
          "name" : "Pico do Areeiro"
        }
      ]
    },
    {
      "name" : "Zona Noroeste",
      "poi" : [
        {
          "name" : "Serra de Água"
        },
        {
          "name" : "São Vicente Caves and Volcanism Centre"
        },
        {
          "name" : "Seixal Port Beach and 'Poças das Lesmas' Natural Pools"
        },
        {
          "name" : "Fanal"
        },
        {
          "name" : "Porto Moniz Village and Natural Pools"
        }
      ]
    }
  ]
}
